config/DataProcessors/ГенераторЗаявкиНаПеремещениеВОнлайнЗону.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ГенераторЗаявкиНаПеремещениеВОнлайнЗону</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аптека</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОнлайнЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

config/AccumulationRegisters/ПартииЖНВЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииЖНВЛС</Name>
			<Comment>Учет по партиям товаров</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Колво</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСЗакуп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРознСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРознНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/Enums/ИА_СтатусСтрокиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ИА_СтатусСтрокиЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дефектура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заказан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетИНеБудет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПробивать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенЗаказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/DataProcessors/ГенераторЗаявкиНаПеремещениеВОнлайнЗону/Ext/ObjectModule.bsl
Процедура ПослатьПисьмо()
	
	Если  ПустаяСтрока(Аптека.Мэйл)=Истина Тогда
		Возврат;
	КонецЕСли;	
	
	//------------------<ШАБЛОН ПОСЛАТЬ ПИСЬМО>----------------------GtG----
	МПочтец= Обработки.Почтарь;
	
	Почтец=МПочтец.Создать();
	Почтец.СписокВложений.Очистить();
	Почтец.Рассылка.Очистить();
	
	
	Почтец.Автоотправка=ИСТИНА;
	
	
	
	Почтец.Рассылка.Добавить(СокрЛП(Аптека.Мэйл));
	
	
	
	Почтец.Тема="### СРОЧНО!!! ЗАЯВКА НА ПЕРЕМЕЩЕНИЕ В ИНТЕРНЕТ АПТЕКУ!!! №"+Заказ.Номер+" ###";
	Почтец.ТекстПисьма="НЕОБХОДИМО ПРИНЯТЬ ЗАЯВКУ НА ПЕРЕМЕЩЕНИЕ ТОВАРА В ИНТЕРНЕТ АПТЕКУ 
	|"+ОнлайнЗона+"
	| С ПОМОШЬЮ ТРАНСМИТТЕРА (если его нет, то через FTP-сервис).
	| СОБРАТЬ ТОВАР, ПРОВЕСТИ МЕЖСКЛАДСКУЮ ПЕРЕДАЧУ(РАСХОД) ВЫГРУЗИТЬ ЕЁ И ПЕРЕДАТЬ В ОФИС ЧЕРЕЗ FTP-СЕРВИС
	|------------------------------------------
	|"+ ПараметрыСеанса.ТекущийСотр.Наименование;
	
	Ф=Почтец.ПолучитьФорму("Форма", "", Новый УникальныйИдентификатор);
	Ф.Открыть();
	//--------------------------------------------------------GtG----КОНЕЦ--
КонецПроцедуры	





Процедура МО_ВыгрузитьЗаказ(Заказ) Экспорт
	
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ИнтернетЗаказТовар.Ссылка.Склад.Код КАК OnLine_Skd,
	                    |	ИнтернетЗаказТовар.Ссылка.ФизическаяАптека.Код КАК OFFLn_Skd,
	                    |	ИнтернетЗаказТовар.Ссылка.Номер КАК Num,
	                    |	ИнтернетЗаказТовар.Ссылка.Дата КАК Date,
	                    |	ИнтернетЗаказТовар.ЕИТ.Код КАК EIT_code,
	                    |	ИнтернетЗаказТовар.Товар.Наименование КАК GoodName,
	                    |	ИнтернетЗаказТовар.ЕИТ.НаименованиеТовара КАК EITName,
	                    |	ИнтернетЗаказТовар.Количество КАК QNT,
	                    |	ИнтернетЗаказТовар.ЦенаСоСкидкой КАК SellPrice,
	                    |	ВЫБОР
	                    |		КОГДА ИнтернетЗаказТовар.К = 0
	                    |			ТОГДА 1
	                    |		ИНАЧЕ ИнтернетЗаказТовар.К
	                    |	КОНЕЦ КАК EIT_K_inf,
	                    |	ИнтернетЗаказТовар.Ссылка.НомерЗаказа КАК NUMZAK,
	                    |	ИнтернетЗаказТовар.Ссылка.ТипИсточника КАК ТипИсточника,
	                    |	ИнтернетЗаказТовар.Ссылка.Склад,
	                    |	ИнтернетЗаказТовар.Ссылка.ФизическаяАптека,
	                    |	ИнтернетЗаказТовар.Товар
	                    |ПОМЕСТИТЬ ЗаказТовара
	                    |ИЗ
	                    |	Документ.ИнтернетЗаказ.Товар КАК ИнтернетЗаказТовар
	                    |ГДЕ
	                    |	ИнтернетЗаказТовар.Ссылка = &Ссылка
	                    |	И ИнтернетЗаказТовар.СтатусСтроки <> &СС_Собран
	                    |	И ИнтернетЗаказТовар.СтатусСтроки <> &СС_НеПробивать
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ПартииЖНВЛСОстатки.Товар,
	                    |	ПартииЖНВЛСОстатки.Партия.Наименование КАК партия,
	                    |	ПартииЖНВЛСОстатки.КолвоОстаток,
	                    |	ПартииЖНВЛСОстатки.СуммаРознСНДСОстаток / ВЫБОР
	                    |		КОГДА ПартииЖНВЛСОстатки.КолвоОстаток = 0
	                    |			ТОГДА 1
	                    |		ИНАЧЕ ПартииЖНВЛСОстатки.КолвоОстаток
	                    |	КОНЕЦ КАК ЦенаМинЕд
	                    |ПОМЕСТИТЬ Остатки
	                    |ИЗ
	                    |	РегистрНакопления.ПартииЖНВЛС.Остатки(
	                    |			,
	                    |			Склад = &ФизАптека
	                    |				И товар В
	                    |					(ВЫБРАТЬ
	                    |						ЗаказТовара.Товар
	                    |					ИЗ
	                    |						ЗаказТовара КАК ЗаказТовара)) КАК ПартииЖНВЛСОстатки
	                    |ГДЕ
	                    |	ПартииЖНВЛСОстатки.КолвоОстаток > 0
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ЗаказТовара.OnLine_Skd,
	                    |	ЗаказТовара.OFFLn_Skd,
	                    |	ЗаказТовара.Num,
	                    |	ЗаказТовара.Date,
	                    |	ЗаказТовара.EIT_code,
	                    |	ЗаказТовара.GoodName,
	                    |	ЗаказТовара.EITName,
	                    |	ЗаказТовара.QNT,
	                    |	ЗаказТовара.SellPrice,
	                    |	ВЫРАЗИТЬ(ЗаказТовара.EIT_K_inf КАК ЧИСЛО(15, 2)) КАК EIT_K_inf,
	                    |	ЗаказТовара.NUMZAK,
	                    |	ЗаказТовара.ТипИсточника,
	                    |	ЕСТЬNULL(Остатки.партия, """") КАК PRT_1S,
	                    |	ЕСТЬNULL(Остатки.КолвоОстаток, 0) КАК Ost_1S,
	                    |	ЕСТЬNULL(Остатки.ЦенаМинЕд, 0) * ЕСТЬNULL(ЗаказТовара.EIT_K_inf, 1) КАК SPrice_1S
	                    |ИЗ
	                    |	ЗаказТовара КАК ЗаказТовара
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	                    |		ПО ЗаказТовара.Товар = Остатки.Товар
	                    |ГДЕ
	                    |	Остатки.партия <> """"
	                    |	И Остатки.КолвоОстаток > 0
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |УНИЧТОЖИТЬ ЗаказТовара
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |УНИЧТОЖИТЬ Остатки");
	
	Запрос.УстановитьПараметр("Ссылка",Заказ);
	Запрос.УстановитьПараметр("ФизАптека",Заказ.ФизическаяАптека);
	Запрос.УстановитьПараметр("СС_Собран",Перечисления.ИА_СтатусСтрокиЗаказа.Собран);
	Запрос.УстановитьПараметр("СС_НеПробивать",Перечисления.ИА_СтатусСтрокиЗаказа.НеПробивать);
	
	
	
	ТЗ=Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество()=0 Тогда
		Предупреждение("Нечего заказывать");
		Возврат;
	КонецЕсли;	
	
	
	ТЗ.Колонки.Добавить("NUMZstr");
	Для каждого стр из ТЗ цикл
		стр.NUMZstr=""+сокрлп(стр.ТипИсточника)+"-"+формат(стр.NUMZAK,"ЧГ=0");
	КонецЦикла;
	
	ТЗ.Колонки.Удалить("ТипИсточника");
	ТЗ.Колонки.Удалить("NUMZAK");
	
	
	
	КВФ=КаталогВременныхФайлов(); // заканчивается на \
	
	ДБФ=Новый XBase;
	ДБФ.Кодировка=КодировкаXBase.ANSI;
	
	
	
	Для Каждого Кол из ТЗ.Колонки Цикл
		
		
		
		
		Если Кол.ТипЗначения.содержиттип(тип("Строка"))=Истина Тогда
			ТипПоля="S";
			Длина=Кол.ТипЗначения.КвалификаторыСтроки.Длина;
			Если Длина=0 Тогда
				Длина=250;
			КонецЕсли;
			Точность=0;
		ИначеЕсли Кол.ТипЗначения.содержиттип(тип("Число"))=Истина Тогда
			ТипПоля="N";
			Длина=Кол.ТипЗначения.КвалификаторыЧисла.Разрядность;
			Точность=Кол.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти;
			Если Длина=0 ТОгда
				Длина=15;
				Точность=2;
			КонецЕсли;	
			
		ИначеЕсли Кол.ТипЗначения.содержиттип(тип("Дата"))=Истина Тогда
			ТипПоля="D";
			Длина="";
			Точность="";
		Иначе
			ТипПоля="S";
			Длина=250;
			Точность=0;
		КонецЕсли;
		
		
		ДБФ.поля.Добавить(Кол.Имя,ТипПоля,Длина,Точность);
	КонецЦикла;
	
	ДБФ.СоздатьФайл(КВФ+"IORDER.DBF");
	
	Для Каждого СТр Из ТЗ Цикл
		
		ДБФ.Добавить();
		
		//ДБФ.OnLine_Skd  = Стр.OnLine_Skd ;
		//ДБФ.OFFLine_Skd = Стр.OFFLine_Skd ;
		//ДБФ.Num         = Стр.Num ;
		//ДБФ.Date        = Стр.Date ;
		//ДБФ.EIT_code    = Стр.EIT_code ;
		//ДБФ.GoodName    = Стр.GoodName ;
		//ДБФ.EITName     = Стр.EITName ;
		//ДБФ.QNT         = Стр.QNT ;
		//ДБФ.SellPrice   = Стр.SellPrice ;
		//ДБФ.EIT_K_inf   = Стр.EIT_K_inf ;
		
		ЗаполнитьЗначенияСвойств(ДБФ,Стр);
		
		ДБФ.Записать();
		
	КонецЦикла;
	
	ДБФ.Записать();
	ДБФ.ЗакрытьФайл();
	
	
	//---------------<Пыряние файлов туда сюда>---------------------------// GtG // 24.09.2012 18:20:15
	ИмяФайла="IND"+Аптека.Код+"_"+Формат(Заказ.Номер,"ЧГ=")+"_"+Формат(Заказ.Дата,"ДЛФ=D")+".DBF";
	ИмяZipФайла=СтрЗаменить(ИмяФайла,".DBF",".ZIP");
	
	ПереместитьФайл(КВФ+"IORDER.DBF",КВФ+ИмяФайла);
	
	ОМ17_ЗапаковатьФайлИСкопироватьЕгоВПапку (КВФ+ИмяФайла,КВФ+ИмяZipФайла);
	УдалитьФайлы(КВФ+ИмяФайла);
	
	РезФайл=Аптека.КаталогОбмена+ИмяZipФайла;
	
	ПереместитьФайл(КВФ+ИмяZipФайла,РезФайл);
	
	ПослатьПисьмо();
	
	//---------------<Отметим в истории изменений заказа что заявка была выгружена>---------------------------// GtG // 15.11.2012 20:14:23
	ОбЗаказ=Заказ.ПолучитьОбъект();
	СтрИзм=ОбЗаказ.Изменения.Добавить();
	СтрИзм.Дата=ТекущаяДата();
	СтрИзм.КомментарийИзменения="Выгружена заявка на перемещение в аптеку №"+Аптека.НомерАптеки+" файл "+РезФайл;
	СтрИзм.ТипИзм=ОбЗаказ.СтатусЗаказа;
	СтрИзм.Сотрудник=ПараметрыСеанса.ТекущийСотр;
	ОбЗаказ.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры
